function getDeeds () {

var deeds = [
    {
        "style": "deed",
        "style_color": 1,
        "name": "kill",
        "id": "x-1-1",
        "io": "i",
        "version":[ 
            {
                "word" : "救人",
                "degree" : 1,
				"intro" : "当学会人与人之间的尊重以后，就不会去伤害别人了，而且，也会慢慢的用这种方式尊重其他生命，包括这世界上看得见的生物，以及看不见的其他众生。当我们对他们也一样尊重时，就会在不杀生之外，自然而然地放生。放生是为了培养慈悲心。虽然佛教徒放生有时会被批评，认为放了这批，也会有下一批被杀，后一批的生命被杀害是放生造成的。但是，这和医生救人是一样的道理。即使是作恶多端的枪击要犯，医生也要救，因为医生只考虑到要怎么治病救人。也许医生花了很长的时间救人，也花了很多医药费，而且这个人出院后，也可能马上死掉，但不能因为病人是肝癌末期又受了枪伤，反正本来就会死，所以就不救人。放生也是一样的，当我们看到动物在受苦难时，当下解救牠，至于牠后面的众生是否会被杀，或者这个众生会不会因为我放掉，又被别人捉来杀死，这就要看牠各自的业力了。所以不管任何时候，我们都应该尽量给予众生无畏惧的布施。如果能舍离杀生的罪行，就能得到成就十种脱离苦恼的善法，是那十种呢？第一：对各种众生普遍布施没有怖畏。第二：时常对于众生会生起大慈悲心。第三：永远断除一切嗔恨恚怒的习气。第四：身体时常无病苦。第五：寿命会活得长远。第六：时常会受非人类的鬼神所守护。第七：时常没有可怕的恶梦，寝睡或者觉醒都很快乐。第八：灭除一切结怨，怨恨仇害自然解除。第九：不会堕落地狱、畜牲、饿鬼三恶道的恐怖。第十：命终后必定上生天界。就是这十种功德利益。"
            },

            {
                "word" : "杀生",
                "degree" : -1,
				"intro" : "杀生，是佛教徒的第一大罪业。皈依佛门之后，不能伤害别的生命是最基础、最根本的戒律。人们杀生的原因很多，贪念、憎恨、傲慢、无明等都有可能。很多宗教徒为了信仰而发动所谓的圣战，或是杀牛宰羊、杀猪宰鸡来祭神、祭天地，古时候甚至还有杀人祭天的情形，这表面上是为了信仰而奉献，但其实是因信仰而牺牲其他生命。这些都是因为无明而杀生，但在自己的认知上却认为是在修行，这类杀生的情形非常多。当别人杀生时，自己在一旁随喜，都有同样的罪业，何况是唆使别人去造业。而且，凡是参与杀生的人，都会得到杀生同等的罪业，而不是一个杀生的罪业，由大家来平均分担承受。而杀生的罪业果报，是短命、折寿，以及罹患疾病等痛苦。"
            }
        ]
    },

    {
        "style": "deed",
        "style_color": 1,
        "name": "theft",
        "id": "x-1-2",
        "io": "i",
        "version":[ 
            {
                "word" : "布施",
                "degree" : 1,
				"intro" : "要对治偷窃，就尽量去施舍。布施，不一定是给别人钱财，也可以说好话，或是有人做好事时，不吝于赞美，就是因为我们做不了，所以去赞美、随喜他人。多参与做义工也是很好的布施，而不是只停留在佛法理论的研讨上面。如果经济能力足够，福报大，布施多一点也没关系。就像世界上有很多富豪，自己拥有很多而且懂得回馈大众，到处做慈善事业。毕竟财富来自于大众，如果懂得回馈，自己的福报就会继续增长。所以，布施也是能让我们从烦恼中解脱的方法。如果能舍离偷盗的罪行，就能得到十种有保障而可信的善法，是那十种呢？ 第一：物质财产盈积充足，而且国王、盗贼、水灾、火灾、不可爱的败家子，都不能消散毁灭。 第二：多数人会敬爱怀念。 第三：别人不会欺负。 第四：十方的人都会赞美。 第五：不用担忧会受损害。 第六：善良的名声流传远布。 第七：处在群众心无畏惧。 第八：钱财、寿命、容色、体力都一切安乐，而且辩论口才具足没有缺陷。 第九：时常怀著布施救助的心意。第十：寿命终了必定上生天界。就是这十种。"
            },

            {
                "word" : "偷盗",
                "degree" : -1,
				"intro" : "偷盗，或说不予取，就是将不属于自己的财物，占为己有。靠暴力取得财富，是最严重的偷盗。例如，有权力的人，透过发动战争恐吓别的国家或民族，把对方的财富占为己有。就像东欧或阿拉伯地区的战争，很多是因为争夺石油而引起，类似这些都是拥有强权的人，用暴力去取得他人的财富。当然，其他地区也有很多这种用暴力抢劫别人财富的人。另外一种比较严重的偷盗，就是靠虚伪奸诈的方式，取得别人的财物。比如，很多人逃漏税或贪污，用一些明目张胆的取巧方式，把别人的财富据为己有。这些都是偷盗，即使是偷一些小东西，都是佛教所讲的不予取。"
            }
        ]
    },

    {
        "style": "deed",
        "style_color": 1,
        "name": "lewd",
        "id": "x-1-3",
        "io": "i",
        "version":[ 
            {
                "word" : "纯洁",
                "degree" : 1,
				"intro" : "出家人禁行不净行，在家居士则是一夫一妻制，这是佛教的规定。还有些人透过受戒、修禁行来清净罪业。例如受八关斋戒。正月初一到十五是释迦牟尼佛降伏外道的十五天，或每个月的初八、初十、十五，尤其四月八日是伟大的释迦牟尼佛诞生的日子，四月十五日是成道日，这些都是修八关斋戒很好的时间。如果能舍离邪淫秽行，就会得到四种智者所称赞的善法，是那四种呢？第一：眼、耳、鼻、舌、身、意六根器官，都很调顺。第二：永久远离纠纷諠闹与内心的掉举散乱。第三：受世人所称赞。第四：妻子没有人能侵犯。"
            },

            {
                "word" : "邪淫",
                "degree" : -1,
				"intro" : ""
            }
        ]
    },

    {
        "style": "word",
        "style_color": 2,
        "name": "lie",
        "id": "x-2-1",
        "io": "i",
        "version":[ 
            {
                "word" : "诚实",
                "degree" : 1,
				"intro" : "第一种不讲谎言，就是讲真实语。但是讲真实语要非常小心，用真实语揭别人疮疤时，就变成是严重的恶口，并不是真实语，也不是忠言逆耳，反而是罪过，这是需要善巧的。但有一种谎言可以被允许，就是如果有人要杀生或伤害别人，为了要阻止他造业而说谎欺骗他，是可以的。如果能舍离打妄语的罪业，就能得到八种天神所赞叹的善法，是那八种呢？第一：口常清净，发出优钵青莲花的香气。第二：被一切世间人所信仰伏从。第三：所发的言语可成为证明，受人间天上所敬爱。第四：时常用爱语安慰众生。第五：心意能得到殊胜的安乐，身口意三业都很清净。第六：说话不会错误过失，内心时常欢喜愉快。第七：所发出的语言必受他人尊重，人间天上的人都会一一奉行。第八：智慧庄严殊胜，没有人能超越制伏他。"
            },

            {
                "word" : "妄语",
                "degree" : -1,
				"intro" : "妄语，是指对人说不真实的谎话。大妄语指带有邪见的谎言，例如，否定善有善报，恶有恶果，否定轮回六道的痛苦与究竟的解脱，甚至否定佛陀的功德，没有一种比这更大的妄语，所以称为大妄语。另一种比较严重的是看不到鬼、天人，却骗别人自己看得见，没有神通，却对别人自夸有神通；修行没有成就，却宣称有成就。而且这样说的唯一目的，就是为了招摇撞骗，如果是出家人，就马上破戒了，这是比较严重的谎言。一般而言，这种情形比较容易发生在宗教信徒之间，因为没有信仰的人想用这种方式欺骗别人，机会是不多的。"
            }
        ]
    },

    {
        "style": "word",
        "style_color": 2,
        "name": "alienate",
        "id": "x-2-2",
        "io": "i",
        "version":[ 
            {
                "word" : "团结",
                "degree" : 1,
				"intro" : "如果有人讲是非时，就应该尽量叫他别讲了，因为讲是非会让人彼此起纷争。本来是一点小事，但有人却会加油添醋、夸大其词，让双方变得水火不容。更严重的是挑拨出家人，这是破和合僧，这种罪业和杀死自己父母没有两样，会堕到无间地狱。如果能舍离两舌挑拨的罪业，就能得到五种不可破坏的善法，是那五种呢？第一：得到不被破坏的身体，因为没有人能伤害他。第二：得到不被破坏的家庭眷属，因为没有人能破害他。第三：得到不被破坏的信用，因为顺于本份所修的道业。第四：得到不被破坏的法力道行，因为所修的道行很坚固。第五：得到不被破坏的善知识，因为不曾欺诳迷惑别人。"
            },

            {
                "word" : "离间",
                "degree" : -1,
				"intro" : "挑拨离间，大到挑拨社区与社区之间，或是种族与种族之间的关系，小到在朋友与朋友之间挑拨是非，让地方上或人与人之间不得安宁。包括公开而说的离间语，和暗中而说的离间语，都是两舌。"
            }
        ]
    },

    {
        "style": "word",
        "style_color": 2,
        "name": "insult",
        "id": "x-2-3",
        "io": "i",
        "version":[ 
            {
                "word" : "善言",
                "degree" : 1,
				"intro" : "尽量多念经、持咒，多讲些对别人有意义和能带来快乐的话，让别人的心灵得到抚慰。譬如对悲伤的人，讲些可以让他从悲痛中走出来的语言。像这些正面的言语要多讲。如果能舍离恶毒的口业，就能成就得到八种清净的善业，是那八种呢？第一：所说的话不乖违适度。第二：所说的话都对人有利益。第三：所说的话必定契合真理。第四：言语词句都很美妙。第五：所说的话都可以承受领会。第六：所说的话可以相信采用。第七：所说的话不会被人讥笑。第八：所说的话全部都是令人可爱，别人乐于接受。"
            },

            {
                "word" : "恶语",
                "degree" : -1,
				"intro" : "恶口伤人，倒不一定只是粗口骂人。例如，虽然某件事情是事实，但你直言不讳，而且直言并不是出于善意，而是出于一种伤害别人的想法，这也是一种恶口。像有些人有精神疾病或身体残缺，如果你直接挑明这点来说，让别人的心灵受到伤害，也算是恶口。很多人以为不骂人就不叫恶口，事实上，有时候虽然我讲的是忠言，但如果直接伤害到别人时，所谓言语不带刀，却会让人心碎，也是一种罪业。"
            }
        ]
	},

    {
        "style": "word",
        "style_color": 2,
        "name": "flatter",
        "id": "x-2-4",
        "io": "i",
		"version":[ 
            {
                "word" : "正直",
                "degree" : 1,
				"intro" : "绮语也是如此。如果和某些人谈天说地，聊的事并没有什么善恶之分，只是为了吸引他们进入佛门，这是可以的。表面上看起来是跟他们一起造业，但目的是要透过这样的方式，引他们进入佛门，这是可以被原谅的。如果能舍离花言巧语的口业，就能得到三种决定不变的果报，是那三种呢？第一：决定被有智慧的人所喜爱。第二：决定能用智慧依照事实回答所问。第三：决定在天上人间所成就威德是最殊胜的，因为所说的话没有虚妄不实的花言巧语。"
            },

            {
                "word" : "绮语",
                "degree" : -1,
				"intro" : "绮语是什么？一般来讲，谈话内容没有牵涉到严重的欺骗，但是讲一些无聊的事，或是闲聊一些是非，就是绮语，这类绮语常常发生，这会在我们修行时造成障碍。"
            }
        ]
	},

    {
        "style": "mind",
        "style_color": 3,
        "name": "greed",
        "id": "x-3-1",
        "io": "i",
		"version":[ 
            {
                "word" : "满足",
                "degree" : 1,
				"intro" : "不贪，就是要多施舍，和前面讲的不予取是一样的。如果能舍离贪求欲望，就能得到成就五种自在满足，是那五种呢？第一：身口意三业自在满足，因为眼、耳、鼻、舌、身、意六根都具足圆满。第二：财产宝物自在满足，一切怨仇盗贼都不能抢夺去。第三：福报德行自在具足，能随心所欲，因为一切物品都能具备满足。第四：国王的权位自在满足，任何珍贵奇妙的宝物，各方都会来奉献。第五：所获得的物品都超过所希求的，甚至超过百倍的殊胜，这是由过去世不悭贪不嫉妒别人的缘故。"
            },

            {
                "word" : "贪欲",
                "degree" : -1,
				"intro" : "贪心，就是对于不属于自己的任何人事物，包括财物、非财物、物质、非物质性的种种东西，虽然还没有付诸行动，只要在意念上产生占为己有的心，就算是有了贪心。"
            }
        ]
	},

    {
        "style": "mind",
        "style_color": 3,
        "name": "resent",
        "id": "x-3-2",
        "io": "i",
		"version":[ 
            {
                "word" : "忍耐",
                "degree" : 1,
				"intro" : "多点慈悲心，多培养利益别人的心态。如果能舍离嗔恨恚怒心的意业，就能得到八种喜悦的心法，是那八种呢？第一：没有损害恼乱的心。第二：没有嗔恨恚怒的心。第三：没有斗诤诉讼的心。第四：有柔顺温和本质正直的心。第五：能得到圣者的慈悲心。第六：时常作利益安慰众生的心。第七：身体相貌端正庄严，众人都共同尊敬。第八：以和气忍辱的缘故，能快速生到清净世界。"
            },

            {
                "word" : "嗔恚",
                "degree" : -1,
				"intro" : "瞋心，对他人的所作所为和拥有的一切，心中不满，想伤害他人，让对方受到痛苦，这些对他人生起损恼心，都是瞋心。"
            }
        ]
	},

    {
        "style": "mind",
        "style_color": 3,
        "name": "folly",
        "id": "x-3-3",
        "io": "i",
    	"version":[ 
            {
                "word" : "正见",
                "degree" : 1,
				"intro" : "经常听闻佛法，让自己有正知正见。如果能舍离愚痴邪见，就能得到成就十种的功德善法，是那十种呢？第一：能得到真正善心的快乐，得到真诚善良的善知识。第二：深信因果报应，宁可牺牲自己的生命，始终都不敢做恶业。第三：只专心归依佛教，不再归依其他的天神外道等。第四：把持正直的心正见的心，永远脱离一切吉凶的疑惑罗网。第五：会时常生在人间天上，不会再堕落地狱、畜生、饿鬼三恶道中。第六：具足无量福慧，展转增加殊胜。第七：永远舍离邪魔外道，实行佛法圣道。第八：不起虚幻的五蕴之体而生身见执著，舍离一切恶业。第九：安住在无碍的正确见解中。第十：不会堕落各种的灾难。"
            },

            {
                "word" : "邪见",
                "degree" : -1,
				"intro" : "邪见大致可分为无因果论、断见及常见。持邪见的人，不但自己迷乱了本性，还影响他人无法学习到正法，阻断他人的慧命，障碍他人进入佛道。所以，十不善中，邪见罪业极为严重。"
            }
        ]
	},

    {
        "style": "vipake",
        "style_color": 4,
        "name": "senior",
        "id": "y-1-1",
        "io": "o",
 		"version":[ 
            {
                "word" : "人",
                "degree" : 1,
				"intro" : ""
            },

            {
                "word" : "地狱",
                "degree" : -1,
				"intro" : ""
            }
        ]
	},

    {
        "style": "vipake",
        "style_color": 4,
        "name": "middle",
        "id": "y-1-2",
        "io": "o",
  		"version":[ 
            {
                "word" : "天",
                "degree" : 1,
				"intro" : ""
            },

            {
                "word" : "恶鬼",
                "degree" : -1,
				"intro" : ""
            }
        ]
	},

    {
        "style": "vipake",
        "style_color": 4,
        "name": "junior",
        "id": "y-1-3",
        "io": "o",
		"version":[ 
            {
                "word" : "阿修罗",
                "degree" : 1,
				"intro" : ""
            },

            {
                "word" : "旁生",
                "degree" : -1,
				"intro" : "天"
            }
        ]
	},

	   
	{
        "style": "nisyanda",
        "style_color": 5,
        "name": "kill",
        "id": "y-2-1",
        "io": "o",
        "version":[ 
            {
                "word" : "长寿",
                "degree" : 1,
				"intro" : "起码为了身体健康，忏悔是绝对有帮助的。如果能依靠修行而从病痛中康复，也是一种短暂的解脱。但很多人念百字明忏悔一段时间后，会因为看不见恶业是否减少，就开始慢慢麻木，不再积极忏悔了。但事实上，在忏悔的当下，很多业力就已经被净化了，这是一种不知不觉的净化。只要能够持续，恶业终究可以完全清净，是可以消除病痛或灾难的，所以忏悔要持续下去。除此之外，更要懂得珍惜生命，而且不只是珍惜人类的生命，还要珍惜所有生命。有能力就放生，没能力就竭尽所能帮助其他生命延长寿命，这些都是从病痛或灾难解脱的好方法。断除杀生，可以长寿少病。长寿不会夭折短命，不会被任何一切怨仇盗贼所损害。"
            },

            {
                "word" : "死亡",
                "degree" : -1,
				"intro" : "特别多疾病有很多众生因为前世杀生过多，而投生到地狱、旁生或饿鬼道，已经受够各种痛苦，后来虽然投胎到人世间，但却在母胎中就死亡，或是一生下来就死去。虽然这跟家人有一点共业关系，因为共业而让父母受苦，但是对胎儿本身来讲，是因为前世杀生过多的缘故，所以没办法在这世上活下来。这种情形会重覆很多世，投胎死亡后，再投胎又死亡，而每次死亡就要遭受一次死亡的痛苦。或像有些人虽然顺利出生，但是一生下来，就满身疾病，一辈子都在看医生、打针、动手术，不停地做这些事。从生下来直到死亡为止，一直要感受身体疾病或别人的伤害，这些就是杀生的感受等流果。很多时候我们会想，自己到底是造了什么业，为什么一切的痛苦都要降临在自己身上。很多人会不甘愿，认为为什么偏偏都是自己生病，别人不生病？为什么自己家里常常出事，别人都没事？事实上不必埋怨，也不用寻找太多原因，原因只有一种，就是自己前世杀生或伤害别人的业果。还有，很多时候我们做事无法成功，便会怨天尤人，但如果做事一直不顺遂，就要想到这是前世因果业力所导致的结果。"
            }
        ]
    },

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "theft",
        "id": "y-2-2",
        "io": "o",
        "version":[ 
            {
                "word" : "富裕",
                "degree" : 1,
				"intro" : "断除偷盗，能具足生活上的受用资财，不会遇到偷盗抢夺。很多人来到这世间，好像不需要努力，很快就变成富豪；很多人读书好像不需太用功，很快就变成很有学问的人；但是，也有很多人努力很久也无法成功；又或许有些人的学问很不错，但想赚钱却永远赚不到。有些人仅有十万元的福报，但有些人则有一百万的福报。或是有人虽然财富会增长，但到了某个阶段，便又开始减少，之后又会往上增长，财富的总额一直上下浮动不定。这样去观察，会发现因果业力真的是不可思议，所以，当我们有福报时，要适时做布施、参加荟供、点灯供佛、打斋，可以多做些善事，也许就能够突破这种状况，可以从贫穷中得到解脱。其实，痛苦的开始，是在拥有之后。人们在没有一百万时，会因为想拥有一百万而付出很多努力，但拥有之后却想要更多，烦恼一直增长，心灵无法满足的煎熬就像饿鬼道的众生。所以，财富够用就好，如果有多余的能力就要去帮助其他生命，或是上供诸佛菩萨、下施六道众生。多做慈善事业，会让我们的心灵愈来愈富有，可以从这种业力牵绊中得到解脱。所获得的一切都是最殊胜没有人可以相比，都能具备积集所有诸佛的圣法宝藏。"
            },

            {
                "word" : "贫穷",
                "degree" : -1,
				"intro" : "很多财富都会被别人抢走、骗走。前生常偷盗，今生会很贫穷，无论他多么努力，所得到的财富只有一点点；有的人表面上看起来很富有，其实真正属于自己的很少，大多是赚给别人用，我们大部份是这种人。一般来说，勤劳的人可以得到较多财富，因为他付出了较多的努力，但有时并不一定这样，很多人辛勤一辈子，仍然非常穷困。有的情形则是因为共业，所以生长在同一环境的人，贫富相差不大。贫穷的定义，并不是缺钱就是穷，如果心穷，那么变成富豪也没有用，因为会舍不得吃、舍不得穿，怕被抢、怕被偷，这也是等流果。"
            }
        ]
    },

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "lewd",
        "id": "y-2-3",
        "io": "o",
        "version":[ 
            {
                "word" : "和睦",
                "degree" : 1,
				"intro" : "不邪淫则可以家庭美满。他的家人眷属都能守贞节而顺从，对他的母亲与妻子，没有人敢用淫欲心去看视她们。"
            },

            {
                "word" : "不忠",
                "degree" : -1,
				"intro" : "邪淫的等流果，是夫妻关系不好，彼此相互怀疑或伴侣对自己不忠等，这种因果业力在现世成熟的也很多。要知道，在家庭或父子、夫妻关系中，我们都像是住在旅馆的旅客一样，相处时间很短暂，所以应该要彼此珍惜，任何事都要站在对方的立场着想，这样就可以变得很和乐。如果没有这样做，就会让前世邪淫的业力一直成熟，造成家庭纷争不断。"
            }
        ]
    },

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "lie",
        "id": "y-2-4",
        "io": "o",
        "version":[ 
            {
                "word" : "赞扬",
                "degree" : 1,
				"intro" : "不打妄语，内心常安乐，没有怖畏与罣碍。脱离众人的毁谤，摄持如来的正法，依照他的誓愿所希求，任何所做都必定能得到结果。"
            },

            {
                "word" : "毁谤",
                "degree" : -1,
				"intro" : "前世常说妄语的人，今生会被别人毁谤或欺骗。有些人没什么过失，但是常常受到别人的毁谤；事实上没有犯罪，但却会受到诬陷。"
            }
        ]
    },

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "alienate",
        "id": "y-2-5",
        "io": "o",
        "version":[ 
            {
                "word" : "和谐",
                "degree" : 1,
				"intro" : "不讲是非的等流果，是周边眷属可以团结和乐。"
            },

            {
                "word" : "争斗",
                "degree" : -1,
				"intro" : "挑拨离间的等流果，是眷属不合，亲友之间互相争斗，彼此怨恨，周围的人无法和谐相处。很多人无法解决人事问题，经常和别人起纷争或闹不愉快，这是前世两舌，讲了太多他人是非，今生才会常有是非跟随，所做的任何事情也经常被别人否定。很多人辛勤努力地做事，但经常有旁人不满意、挑剔，自己的奉献别人看不见，反而老挑剔一些小事。像我有个弟子人很好，但是在公司就是没办法跟人相处，他从来不得罪人、不挑剔别人，但所有人就是对他不满意，看他不顺眼，这就是业力的成熟。最后他持诵缘起咒，别人才慢慢看见他的优点。前世挑拨离间，也会让今生好端端的家庭，虽然什么都不缺，但家人彼此就是看不顺眼，天天吵架，要分开也分不了，这也是挑拨是非的等流果。家庭眷属都会和睦相处，有共同一样的志向与欢喜，永远不会乖违诤闹。"
            }
        ]
    },

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "insult",
        "id": "y-2-6",
        "io": "o",
        "version":[ 
            {
                "word" : "尊重",
                "degree" : 1,
				"intro" : "不恶口，就会经常听到赞美的语言。所有一切群众，都会很欢喜归依，所说的话都会被人相信接受，没有人会违抗拒绝。"
            },

            {
                "word" : "辱骂",
                "degree" : -1,
				"intro" : "恶语的等流果，会常常听到不悦耳的声音；自己无心说的话，也会成为争吵的起源。"
            }
        ]
	},

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "flatter",
        "id": "y-2-7",
        "io": "o",
		"version":[ 
            {
                "word" : "信任",
                "degree" : 1,
				"intro" : "不说绮语，那么说出口的会是真实语，修行上的障碍会比较少，说话会有威信，众生会信服。所说的话都不会虚伪假设，众人都会尊敬接受，又能善巧随方应变教导，断除各种疑问迷惑。"
            },

            {
                "word" : "质疑",
                "degree" : -1,
				"intro" : "绮语的等流果，是讲话没人相信或听从，或讲了真话，可是别人以为是谎言或严肃的认为只是随便说说而已。有些人讲一句话就被牢牢记住，周边的人对他的话都能认同感受，这是前世没有闲聊是非的业力，或是今生不爱聊是非，这种人言语方面的福报就很大。另外，对大众讲话会有恐惧症，也是前世绮语的业果。这些业力都可以透过忏悔来清净。"
            }
        ]
	},

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "greed",
        "id": "y-2-8",
        "io": "o",
		"version":[ 
            {
                "word" : "顺心",
                "degree" : 1,
				"intro" : "无造作贪心恶业，则可心想事成。自己所有的一切，都会惠施喜舍给众生，信心慧解都很坚固，具有很大的威德法力。"
            },

            {
                "word" : "不顺",
                "degree" : -1,
				"intro" : "贪心的果报，是想得到的永远得不到，不想得到的却反而来临，经常遇到不如意的人或事。"
            }
        ]
	},

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "resent",
        "id": "y-2-9",
        "io": "o",
		"version":[ 
            {
                "word" : "无畏",
                "degree" : 1,
				"intro" : "无瞋害心，不会有人事困扰。同时能迅速自然成就了没有障碍的心智，六根庄严美好，所看见的人都会生敬爱心。"
            },

            {
                "word" : "恐惧",
                "degree" : -1,
				"intro" : "瞋恨的等流果报，是今生所受的伤害特别多，所想的事情都无法如意，经常怀有恐惧。就像有些人想做生意，还没开始之前，就想了好多不如意的结果，而如果失败以后，就会害怕而不敢再做了。有些人做事情，第一个念头就先想到负面的，就是前世伤害别人，所以今生做任何事都会有恐惧感。"
            }
        ]
	},

    {
        "style": "nisyanda",
        "style_color": 5,
        "name": "folly",
        "id": "y-2-10",
        "io": "o",
    	"version":[ 
            {
                "word" : "清楚",
                "degree" : 1,
				"intro" : "断除邪见者，则会不断生起善妙的思维和见解。永远会投生在正见又敬信佛教的家庭里，能见佛闻法，供养一切僧宝，时常不会忘失自己所发的大菩提心。"
            },

            {
                "word" : "迷惑",
                "degree" : -1,
				"intro" : "邪见的果报是没有正知正见，除了自己迷惑不定之外，还常常影响四周的人，让人产生错乱，因此，一生中都在是非善恶不明的恶见中度过，还会受到邪魔外道的种种扰乱。很多人都有这种情形。但虽然大家是佛教徒，知道信仰三宝、对因果深信不移才是正见，可是对佛法多少都会带着半信半疑的想法，而一旦有这种想法，邪知邪见要在心中产生就很容易。如果是这种情形，即使为你讲解了所有佛法，也无法影响你太多，但如果是算命的人告诉你应该怎样做，甚至很荒唐的事情，你却都愿意做，反而是偏门的方法，你比较容易相信。这也是为什么世界上有那么多人喜欢走偏门，喜欢没有正知正见、怪力乱神、非正法的信仰，像这样福报不够的人还是多一些。魔子魔孙永远都比佛子佛孙多太多倍了。所以，如果经常让自己的心识错乱、见解不正，果报就会这样。"
            }
        ]
	},

	
    {
        "style": "adhipati",
        "style_color": 6,
        "name": "habitat",
        "id": "y-3-1",
        "io": "o",
		"version":[ 
            {
                "word" : "富庶",
                "degree" : 1,
                "intro" : "幸福安康，富庶"
            },

            {
                "word" : "贫瘠",
                "degree" : -1,
				"intro" : "杀生过多的人，会投胎到很多障碍，容易丧失生命，很危险的地方。造偷盗恶业的人，会生在偏远的山区，或出生在贫瘠缺粮食的地方。常用恶语伤人，会生在荆棘丛生、乱石堆积的地方；喜欢说绮语，会生在气候不定、季节颠倒，五谷不收的地方。贪心恶业者，会生在没有粮食，痛苦众多的环境。"
            }
        ]
	},

    {
        "style": "adhipati",
        "style_color": 6,
        "name": "society",
        "id": "y-3-2",
        "io": "o",
 		"version":[ 
            {
                "word" : "和谐",
                "degree" : 1,
				"intro" : ""
            },

            {
                "word" : "是非",
                "degree" : -1,
				"intro" : "瞋心过重者，会生在恐怖多烦恼的地方。造邪淫者，会生在污秽的环境。说妄语者，会生在财富不安定的环境，常遇到恐怖不安的违缘。造离间语、爱讲是非的人，会生在悬崖深谷的地方，而且周边的朋友之中，会多一些讲是非的人，这就是共业。一个不爱讲是非的人，周边也都是不爱讲是非的人，所以古人用「物以类聚」来形容，这也是佛教讲的共业。"
            }
        ]
	},

    {
        "style": "adhipati",
        "style_color": 6,
        "name": "relative",
        "id": "y-3-3",
        "io": "o",
  		"version":[ 
            {
                "word" : "和睦",
                "degree" : 1,
				"intro" : ""
            },

            {
                "word" : "不和",
                "degree" : -1,
				"intro" : "邪见过重者，会生在财富不足，没有亲友，缺乏保护的地方。"
            }
        ]
	}
];

setDeeds(deeds);
}
